#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ubunturoutervm.random_id.randomid_pip[0]: Refreshing state... [id=N4jWfw]
time_static.current: Refreshing state... [id=2025-02-11T20:16:33Z]
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=78034a915ae7e28245eef0578a8e8008174bc44c2af78c9ba4a469a398498927]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
random_id.id_flow: Refreshing state... [id=ufv5w2ozwO8]
module.ubunturoutervm.random_id.randomIdVM: Refreshing state... [id=qQ9YUoT6nBQ]
random_string.encryption_compute: Refreshing state... [id=9cflvs]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=1084986733]
data.azuread_client_config.this: Reading...
data.azuread_client_config.this: Read complete after 0s [id=400ebb99-99e3-4a2a-af83-b2b5edff74fa-18a2dc63-b93f-42f1-b9d6-f4fe7d8c2b4e-2035781a-45a2-4065-ab81-e1b924cd8eae]
data.azurerm_key_vault.secrets: Reading...
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001]
azurerm_resource_group.rg_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001]
module.spoke2network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001]
module.spoke1network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001]
module.spoke2network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001]
module.spoke1network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001]
module.spoke1network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001]
azurerm_network_watcher.networkwatcher_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub]
azurerm_virtual_network.hub_vnet: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001]
azurerm_network_security_group.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
azurerm_storage_account.flow: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Storage/storageAccounts/stflowb9fbf9c36a33c0ef]
azurerm_log_analytics_workspace.law_platform: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.OperationalInsights/workspaces/law-platform]
azurerm_key_vault.encryption_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.KeyVault/vaults/kv-compute-9cflvs]
azurerm_user_assigned_identity.encryption_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-compute-9cflvs]
module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/publicIPAddresses/pip-vm-hub-dev-001]
data.azurerm_key_vault.secrets: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-tf-infra-001/providers/Microsoft.KeyVault/vaults/kv-tf-infra-sec-001]
azurerm_subnet.hub_subnet["RouterSubnet"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Reading...
data.azurerm_key_vault_secret.vmpassword: Reading...
module.spoke2network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/virtualNetworkPeerings/vnet-spoke2-001-hub]
module.spoke2network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke2-001]
module.spoke2network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke1network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke1-001]
module.spoke1network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/virtualNetworkPeerings/vnet-spoke1-001-hub]
azurerm_subnet_network_security_group_association.nsg_router-association: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
module.ubunturoutervm.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-hub-dev-001-a90f585284fa9c14]
module.spoke2network.azurerm_network_security_group.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-DatabaseTier]
module.spoke2network.azurerm_network_security_group.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-LogicTier]
module.spoke2network.azurerm_network_security_group.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
data.azurerm_key_vault_secret.vmpassword: Read complete after 1s [id=https://kv-tf-infra-sec-001.vault.azure.net/secrets/vmpassword/cd3cca8343d14d4890d1645375fe30fc]
azurerm_monitor_diagnostic_setting.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router|nsg_router_diag]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-WebTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-DatabaseTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-LogicTier]
azurerm_role_assignment.encryption_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.KeyVault/vaults/kv-compute-9cflvs/providers/Microsoft.Authorization/roleAssignments/2217cfbb-24c6-f7e2-fe53-b9e938ac49f0]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001/routes/default-route-entry]
module.spoke1network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001/routes/default-route-entry]
module.ubunturoutervm.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.ubuntuspoke2.random_id.randomIdVM: Refreshing state... [id=6Z5NKFxmZaQ]
azurerm_virtual_machine_extension.ubunturoutervm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001/extensions/vm-hub-dev-001-networkwatcher]
module.ubuntuspoke1.random_id.randomIdVM: Refreshing state... [id=RHBx4BeBJoU]
module.ubuntuspoke2.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-e99e4d285c6665a4]
module.ubuntuspoke1.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-447071e017812685]
azurerm_network_watcher_flow_log.hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/hub-flow]
azurerm_network_watcher_flow_log.spoke1: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke1-flow]
azurerm_network_watcher_flow_log.spoke2: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke2flow]
azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom]
azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom]
azurerm_network_connection_monitor.ubunturoutervm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-hub-dev-001-ubuntucom]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_disk_encryption_set.encryption_compute will be created
  + resource "azurerm_disk_encryption_set" "encryption_compute" {
      + auto_key_rotation_enabled = false
      + encryption_type           = "EncryptionAtRestWithCustomerKey"
      + id                        = (known after apply)
      + key_vault_key_id          = (known after apply)
      + key_vault_key_url         = (known after apply)
      + location                  = "swedencentral"
      + name                      = "des-compute-9cflvs"
      + resource_group_name       = "rg-compute-001"
      + tags                      = {
          + "environment" = "Dev"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-compute-9cflvs",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_key_vault_key.encryption_compute will be created
  + resource "azurerm_key_vault_key" "encryption_compute" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.KeyVault/vaults/kv-compute-9cflvs"
      + n                       = (known after apply)
      + name                    = "cmk-compute-20250211-2016"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "environment" = "Dev"
        }
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom will be updated in-place
  ~ resource "azurerm_network_connection_monitor" "spoke1vm_monitor_ubuntucom" {
        id                            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom"
        name                          = "vm-spoke1-dev-001-ubuntucom"
        tags                          = {
            "environment" = "Dev"
        }
        # (4 unchanged attributes hidden)

      - endpoint {
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "vm-spoke1-dev-001" -> null
          - target_resource_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001" -> null
            # (3 unchanged attributes hidden)
        }
      - endpoint {
          - address               = "archive.ubuntu.com" -> null
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "archive.ubuntu.com" -> null
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke1-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom will be updated in-place
  ~ resource "azurerm_network_connection_monitor" "spoke2vm_monitor_ubuntucom" {
        id                            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom"
        name                          = "vm-spoke2-dev-001-ubuntucom"
        tags                          = {
            "environment" = "Dev"
        }
        # (4 unchanged attributes hidden)

      - endpoint {
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "vm-spoke2-dev-001" -> null
          - target_resource_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001" -> null
            # (3 unchanged attributes hidden)
        }
      - endpoint {
          - address               = "archive.ubuntu.com" -> null
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "archive.ubuntu.com" -> null
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke2-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine_extension.spoke1vm_networkwatcher will be created
  + resource "azurerm_virtual_machine_extension" "spoke1vm_networkwatcher" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "vm-spoke1-dev-001-networkwatcher"
      + publisher                   = "Microsoft.Azure.NetworkWatcher"
      + tags                        = {
          + "environment" = "Dev"
        }
      + type                        = "NetworkWatcherAgentLinux"
      + type_handler_version        = "1.4"
      + virtual_machine_id          = (known after apply)
    }

  # azurerm_virtual_machine_extension.spoke2vm_networkwatcher will be created
  + resource "azurerm_virtual_machine_extension" "spoke2vm_networkwatcher" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "vm-spoke2-dev-001-networkwatcher"
      + publisher                   = "Microsoft.Azure.NetworkWatcher"
      + tags                        = {
          + "environment" = "Dev"
        }
      + type                        = "NetworkWatcherAgentLinux"
      + type_handler_version        = "1.4"
      + virtual_machine_id          = (known after apply)
    }

  # module.ubunturoutervm.azurerm_linux_virtual_machine.spokevm will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "spokevm" {
        id                                                     = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001"
        name                                                   = "vm-hub-dev-001"
        tags                                                   = {
            "environment" = "Dev"
        }
        # (41 unchanged attributes hidden)

      ~ os_disk {
          + disk_encryption_set_id           = (known after apply)
            id                               = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/disks/vm-hub-dev-001_OsDisk_1_f0e545a5728d459380764a9b6d9fb8c3"
            name                             = "vm-hub-dev-001_OsDisk_1_f0e545a5728d459380764a9b6d9fb8c3"
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ubuntuspoke1.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke1.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #cloud-config
            package_upgrade: true
            packages:
              - traceroute
            ntp:
              pools: ['0.de.pool.ntp.org', '1.de.pool.ntp.org', '2.de.pool.ntp.org', '3.de.pool.ntp.org']
        EOT
    }

  # module.ubuntuspoke1.azurerm_linux_virtual_machine.spokevm will be created
  + resource "azurerm_linux_virtual_machine" "spokevm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-spoke1-dev-001"
      + custom_data                                            = (sensitive value)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "vm-spoke1-dev-001"
      + network_interface_ids                                  = [
          + "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-447071e017812685",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-compute-001"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "environment" = "Dev"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.ubuntuspoke2.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke2.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #cloud-config
            package_upgrade: true
            packages:
              - traceroute
            ntp:
              pools: ['0.de.pool.ntp.org', '1.de.pool.ntp.org', '2.de.pool.ntp.org', '3.de.pool.ntp.org']
        EOT
    }

  # module.ubuntuspoke2.azurerm_linux_virtual_machine.spokevm will be created
  + resource "azurerm_linux_virtual_machine" "spokevm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-spoke2-dev-001"
      + custom_data                                            = (sensitive value)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "vm-spoke2-dev-001"
      + network_interface_ids                                  = [
          + "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-e99e4d285c6665a4",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-compute-001"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "environment" = "Dev"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

Plan: 6 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*